* Testing PION for photoevaporating globules


** Summary of initial globule and globule/wind tests

*** globule-002
- Cylindrical symmetry
- This has a small neutral globule (density = 1e6 pcc), located halfway along the symmetry axis (0.5 pc) from an ionizing star in the bottom left corner
- Star is designed to mimic WR124 with a relatively soft ionizing spectrum (Teff = 33,000 K, L = 3.3e5 Lsun)
- Ambient density is 1 pcc

** Options for output formats
- By default, PION uses the silo format, but there is also the option of using FITS files, so we will try that since I am more familiar with them
- We set the parameter
 #+begin_example
   # Output File Type = {text,fits,ftab,both,...}
   OutputFileType both
 #+end_example
 and will see what happens.
- Turns out I couldn't get the FITS output to work, so I will stick with silo for now
  - It writes out a separate FITS file fo each processor it seems
 
** Pure photoionization tests
- we are basing this on the cosmological test case, but changing the parameters to be more suitable for the WR nebula knots
- The distance from the star is about 0.5 pc, which is about 20 arcsec
- The globule size is about 0.2 arcsec, which is about 0.005 pc
  - Although this is the present day size, the globule was probably larger in the past
- The shell density is about 1000 and the i-front density is about 1e4, with the neutral density being about 1e6
  - Although the original density may have been much lower, probably about 1e4
- So this is extremely similar to our parameters in the 2009 magnetic globules paper
- In that case, the evolutionary time was quite long: 100,000 years, which is a bit long for the WR nebula case
  - We should maybe make the original globules smaller, especially since we need to make them quite closely packed, so there is no room for them to have been very big to start with


*** Issues with the photoionization test
- I am having trouble getting sensible results, and I think it has to do with the non-ionizing radiation
- I am getting a heating front in the neutral gas, which causes the globule to expand
- This is using ~chem_code MPv6~, which was a bad idea since it is H only!
- So now I am going to retry with MPv5, which supposedly is based on my 2009 paper
- No, first I will try  MPv7, which is a simple two-temperature interpolation as a function of ionization fraction
- This has now worked well, so I can save this and try and move on to different parameters, and maybe add the wind

** Summary of first successful globule test
- This is now moved to [[file:test-runs/globule-001/test-single-globule-2d.txt]]
- It is in 2D cylindrical symmetry, given what I give for the boundary conditions
  #+begin_src conf
    BC_XN one-way-outflow
    BC_XP one-way-outflow
    BC_YN axisymmetric
    BC_YP one-way-outflow
  #+end_src
  - I think that if I had not specified axisymmetric it would have been in slab symmetry, but I need to check that
- The globule is big and very dense
  #+begin_src conf
    PE_SC0_overdensity 10000
    PE_SC0_xpos 1.0
    PE_SC0_ypos 0.0
    PE_SC0_zpos 0.0
    PE_SC0_vx  0.0
    PE_SC0_vy  0.0
    PE_SC0_vz  0.0
    PE_SC0_radius 0.5
    ...
    PERC_ambRO 1.67e-22 # 100 per c.c.
    PERC_ambPG 1.67e-12 # P_g = rho*kT/mu/m_p
    ...
  #+end_src
  - Strangely, the radius and position seem to be in units of the y dimension of the box, but I am not sure if that is always the case
  - The globule is like a brick. It's pressure is so high that the photoevaporation flow does not manage to drive a shock into it
    - In the side and back directions, it is overpressured with respect to the photoevaporation flow, so it expands and a rarefaction wave moves into the globule
    - This forms an expanding neutral shocked shell
- The star is something I still don't quite understand
  #+begin_src conf
    RT_strength_0    3.82e38 # erg/s for multifrequency source => 1e4 solar luminosities
    RT_Rstar____0    3   # Radius of star in solar radii.
    RT_Tstar____0    5.0e4     # Stellar effective temperature.
  #+end_src
  - So on the face of it, it is low luminosity (1e4 Lsun), but I think that gets over-ridden by the radius and Teff using Stefan-Boltzmann
  - Even so, it would be a low luminosity
  - [ ] I need to work out how to extract the ionized density so I can integrate the emission measure along the symmetry axis and work out what it thinks the ionizing flux is
- We seem to get shadowing instabilities on the front flanks, which form elephant trunk like features, but these are not well resolved

** Second globule test: globule-002
- For this one, we will try and get it the right size for the WR knots
- Still put it at 0.5 pc, but make it smaller:
  - 1e16 cm = 0.003 pc should be the final radius
  - So put at 1% of the grid size, which means we will need to use nested grids
    - So radius is 0.005 pc
    - Argh, we have a problem. Jonathan says:
      : For radiation transport, PION only works with the nested grid for a
      : point source located on the finest grid level.  I haven't yet
      : implemented rays propagating from coarse to fine levels because I'd
      : need a different time-stepping routine.  For uniform grid it works for
      : sources located anywhere (including at infinity along one of the
      : coordinate axes).
  - Keep the same density, 1e6, so that the column density will be 1.5e22
  - 

** globule006 - probably the best static globule
- This is done at higher resolution and showing a smaller box
- 1024 x 256
- 0.5 x 0.125 pc
- Globule density 1e6
- Ambient density 1
- Initial location : 1e18 cm
- Initial radius: 2e16 cm
- Initial mass: 0.037 Msun
  - Which is sort of reasonable

** globule007 - crushed cloud
- Original idea was to try starting the globule close to the star, but giving it an initial velocity
  - Turns out I only gave it 2 km/s instead of 20, but it does not matter
- I also made the globule 3 times larger and 10 times less dense than 006
- The initial position was 10 times closer, at 1e17 cm
- What happened in this case is very interesting:
  1. The initial R-type front ionizes half of the globule (pure chance!)
  2. Then the wind slams into the cloud and makes a thin dense shell
  3. The shell traps the ionization front so that the rest of the cloud recombines
  4. The neutral part of the shell corrugates with a wavelength of about 1/4 of the initial globule radius
  5. The shell fragments forming four small globules that are not well resolved, especially the one on the axis
  6. The little globules develop tails and are accelerated away from the star, mainly by the momentum of the wind
  7. They do develop ionized sheaths around a neutral core, but I am not sure whether they can really be counted as photoevaporation flows
  8. Most get completely photoionized, but maintain there identity as ionized clumps that are accelerated away by the ram pressure of the wind at about 100 km/s
- The simulation crashes eventually, but I am not sure why

** globule008 and globule008-B - three times further from star
- This one is qualitatively different from 007
  1. The R-type front only penetrates the skin of the initial globule
  2. A PE flow starts, and gets back about 10% of the globule radius before the wind hits it
  3. Again it forms a thin shell, which traps the i-front
  4. Neutral shell fragments into about 3 pieces
  5. But most of these get forced down to merge on the symmetry axis
     - We end up with 3 clumps on axis, due to series of convergence events
  6. Densest clump is > 1e9
     - So that is 10,000 times denser than initial globule
     - So that could be done by two shocks with M ~= 10
     - Width is only 1 pixel
     - Mass can be estimated as pi r**2 L rho = pi (1.5e15)**2 2e16 1e9 2e-24 = 2.827e32 g = 0.14 Msun
     - This is very imprecise, but it is more than half of the initial mass of the globule, suggesting that the total mass loss is not that significant so far
  7. One remaining off-axis tendril is lower density
- Eventually this crashes too
*** The B series: put the globule at the cylindrical equator instead of the pole
- I am going to try again, but with the globule on the Y axis, not the X axis
  - So I will be simulating an equatorial torus rather than a cylindrical globule
    - This is because PION is hard-wired so that the X axis is the z cylindrical axis, and Y axis is r
  - Hopefully, this will avoid the problem with the concentration on the axis
  - I have moved the X extent so that it is centered on zero, which means we are not assuming reflection about the equatorial plane
  - And shift the globule slightly off the equatorial plane, so as to break the symmetry
- This has worked really well and has run to completion
  - The initial globule splits into two big clumps, which then subdivide further, giving 3 or 4 evaporating globules during most of the evolution
    - Some of them merge, and the smallest ones are totally dissipated
- When the clumps first form at around 5e17 cm, they have following properties
  - t = 1.1e11 s = 3500 yrs
  - I-front radius of about 1.3e16 cm
  - Peak ionized density of about 6e4 pcc
  - Thickness of ionized layer < r0, so ram pressure dominated
  - Peak neutral density of about 1e6
    - But arranged in a ring with thickness h = 5e15 cm
    - So mass is 4 pi r^2 h n m = 0.01 Msun
    - This is about 1/20 of the initial globule mass
- By the time they get to 0.8e18 cm
  - t = 2.3e11 s = 7300 years
  - Average speed = (0.8e18 - 5e17) / 1e5 (2.3e11 - 1.1e11) = 25 km/s
  - I-front radius of 2e15 to 5e15 cm
  - Peak ionized density about 3e4
  - Peak neutral density still about 1e6
- By the time they get to 1.3e18 cm
  - t = 3.9e11 s = 1.236e+04 years
  - Average speed (1.3e18 - 0.8e18) / 1e5 (3.9e11 - 2.3e11) = 31 km/s
    - So speeding up a bit, but still not quite up to the observed speed
  - Peak ionized density about 2e4
  - Density of ionized shell about 6000
  - I-front radius around 4e15, although for the double headed ones, it is as high as 9e15
  - Shell radius is about 3e16
- We get some interesting behavior during the evolution
  - Sometimes the collision between photoevaporation flows of two neighboring globules manages to trap the ionization front and form a "child" globule
  - But this is quite low density so it is evaporated in a thousand years or less
  - We see this repeating a couple of times when the big clumps are side by side, but eventually the one on the left, which is slightly lower mass, starts to move ahead of the other, so they stop interacting
  - Other globule birthing events are due to wiggles in the tail, which can make a little bit bud off and form its own short-lived globule
- *Conclusions*
  - These globules are pretty much like the observations, but there are a few problems
    1. They should move a bit faster
    2. They should be a bit bigger 
** globule-009-B - closer in again
- This is the same as 008-B, but with the globule starting at 1.5e17 cm instead of 3e17 cm
  - And a larger globule density of 3e5 instead of 1e5
    - With the same initial radius of about 7e16 cm
    - So this would be a mass of 0.5 Msun if spherical
    - But considered as an equatorial ring, it would be 5 Msun
  - Also, the ambient density is 1e3 instead of 1 pcc, so we might get some more interesting interactions with the ambient gas
    - [ ] Although really we want to do this better by having a time variable RSG wind to establish the density distribution
- The idea of this sim was to get bigger clumps accelerated up to faster velocities. I will look at the results for similar times to in the 008-B simulation above
- At 1.1e11 s = 3500 yrs
  - Distance of clumps is 4e17 cm, so slightly closer than 008-B
  - The clump complexes have radius 3e16 cm
    - But the fragmentation is more advanced than in 008-B and we have sub-clumps that are smaller: r = 1e16 cm or less
  - The peak ionized density is about 2e5
    - But density in most of ionized shell is about 1e5
  - The neutral density peaks are 1 to 2e6
    - We have 8 of them with sizes about 1e16 by 2e15 cm
    - So column densities are about 0.5 to 1e22 => AV = 5 to 10
    - If assume spherical, then each has mass about 0.004 Msun
    - Although since we have cylindrical symmetry, they are really rings and much more massive: 0.3 Msun
- At t = 2.3e11 s the densest globules are at 0.7e18 cm
  - So average speed is  (0.7e18 - 4e17) / 1e5 (2.3e11 - 1.1e11) = 25 km/s, exactly the same as in previous model
  - I front radius is about 5e15 cm
- We get to 0.8e18 cm at t = 2.66e11 s
  - Speed = (0.8e18 - 0.7e18) / 1e5 (2.66e11 - 2.3e11) = 28 km/s
- We get to 1.0e18 cm at  t = 3.19e11 s
  - Speed = (1.0e18 - 0.8e18) / 1e5 (3.19e11 - 2.66e11) = 38 km/s
  - I-front radius of the larger massive fragments = 1.5e16 cm
- So these speeds and sizes are quite reasonable
  - That is, they are similar to the observations
*** Wind channels
- During the evolution of this model, we see an interesting phenomenon where the wind sorces open a channel between the two major knot complexes
- Initially, the wind re-accelerates through a nozzle and then drives a new shock in to the ambient medium
- This develops into a bow shock that propagates as follows
  |       t |       r |     v |
  |       s |      cm |  km/s |
  |---------+---------+-------|
  | 1.12e11 |  5.9e17 |     0 |
  | 1.22e11 |  6.7e17 | 80.00 |
  | 1.36e11 |  7.7e17 | 71.43 |
  | 1.62e11 |  9.5e17 | 69.23 |
  | 1.84e11 | 1.10e18 | 68.18 |
  | 2.09e11 | 1.26e18 | 64.00 |
  | 2.25e11 | 1.34e18 | 50.00 |
  #+TBLFM: $3=($2 - @-1$2) / ($1 - @-1$1) $km;f2::@3$3=0
- For most of the lifetime (of about 3500 years), the wind channel is not straight but meanders a bit, which causes a lot of oblique crossing shocks to redirect the flow
- And when the bend angle is too large, it forms a perpendicular shock and then reaccelerates
- Note that the ram pressure driving through the channel is significantly lower than what the unobstructed stellar wind would have at that position
- Eventually, the channel gets pinched off, so the bow shock loses its "jet" and dissipates
- When I look at the
- 
*** rsync commands to transfer subset of files
- For example, every tenth output file
  - Get a list of the files to transfer
    #+begin_src sh
      rsync "ghibli.crya.privado:/Users/will/Work/pion-globules/test-runs/globule-009/globule-009-X*.silo" \
          | cut -f5 -w | awk 'NR % 10 == 0' > files_to_copy
    #+end_src
    - The ~cut~ is to take only the file name without all the other garbage from the listing
    - The ~awk~ command takes every tenth file
  - Copy over only those files
    #+begin_src sh
      rsync -avP --files-from files_to_copy \
            "ghibli.crya.privado:/Users/will/Work/pion-globules/test-runs/globule-009" .    
    #+end_src
